const secondName = [
  '开畅', '开诚', '开宇', '开济', '开霁', '开朗', '凯安', '凯唱', '凯定', '凯风', '凯复', '凯歌', '凯捷',
  '凯凯', '凯康', '凯乐', '凯旋', '凯泽', '恺歌', '恺乐', '康安', '康伯', '康成', '康德', '康复', '康健',
  '康乐', '康宁', '康平', '康胜', '康盛', '康时', '康适', '康顺', '康泰', '康裕', ' L', '乐安', '乐邦',
  '乐成', '乐池', '乐和', '乐家', '乐康', '乐人', '乐容', '乐山', '乐生', '乐圣', '乐水', '乐天', '乐童',
  '乐贤', '乐心', '乐欣', '乐逸', '乐意', '乐音', '乐咏', '乐游', '乐语', '乐悦', '乐湛', '乐章', '乐正',
  '乐志', '黎昕', '黎明', '力夫', '力强', '力勤', '力行', '力学', '力言', '立诚', '立果', '立人', '立辉',
  '立轩', '立群', '良奥', '良弼', '良才', '良材', '良策', '良畴', '良工', '良翰', '良吉', '良骥','良俊',
  '良骏', '良朋', '良平', '良哲', '理群', '理全', ' 茂才','勇毅', '宇达', '宇航', '宇寰', '宇文',
  '茂彦', '敏博', '敏才', '敏达', '敏叡', '敏学', '敏智', '明诚', '明达', '明德', '明辉', '明杰', '明俊',
  '明朗', '明亮', '明旭', '明煦', '明轩', '明远', '明哲', '明喆', '明知', '明志', '明智', '明珠',
  '雅昶', '雅畅', '雅达', '雅惠', '雅健', '雅珺', '雅逸', '雅懿', '雅志', '炎彬', '阳飙', '阳飇',
  '阳冰', '阳波', '阳伯', '阳成', '阳德', '阳华', '阳晖', '阳辉', '阳嘉', '阳平', '阳秋', '阳荣',
  '阳舒', '阳朔', '阳文', '阳曦', '阳夏', '阳旭', '阳煦', '阳炎', '阳焱', '阳曜', '阳羽', '阳云',
  '阳泽', '阳州', '烨赫', '烨华', '烨磊', '烨霖', '烨然', '烨烁', '烨伟', '烨烨', '烨熠', '烨煜',
  '毅然', '逸仙', '逸明', '逸春', '宜春', '宜民', '宜年', '宜然', '宜人', '宜修', '意远', '意蕴',
  '意致', '意智', '熠彤', '懿轩', '英飙', '英博', '英才', '英达', '英发', '英范', '英光', '英豪',
  '英华', '英杰', '英朗', '英锐', '英睿', '英叡', '英韶', '英卫', '英武', '英悟', '英勋', '英彦',
  '英耀', '英奕', '英逸', '英毅', '英哲', '英喆', '英卓', '英资', '英纵', '永怡', '永春', '永安',
  '永昌', '永长', '永丰', '永福', '永嘉', '永康', '永年', '永宁', '永寿', '永思', '永望', '永新',
  '永言', '永逸', '永元', '永贞', '咏德', '咏歌', '咏思', '咏志', '勇男', '勇军', '勇捷', '勇锐',

  '思妍','秀涵','紫婧', '濮婵', '婵莹', '术燕',
  '中颖', '宗颖', '研悦', '艾琳',  '银梅', '玲瑗', '妹利', '霞瑗', '若华', '佳恩', '肇颖',
  '怡晨', '宇琼', '乐倩',  '之歆', '韵涵', '雅菲', '凌静', '芝心', '明茹', '玟媗', '晨希',
  '芝涵', '希新',  '汉萍', '宁英', '育歆', '永君', '潞萱', '金慈', '育萍', '惠洁', '悦竹',
  '淑玉',  '晴悦', '泉秀', '娆倩', '茹靖', '菽文', '霜妍', '硕娅', '婷娴', '绾洁', '绾蓉',
  '绾嫣', '绾怡', '绾悦', '旺莹', '蓓婷', '焕冉', '怡西', '怡习', '宝媛', '婧卓',  '惟娜',
  '炜茹', '晓妍', '悦薇', '敏悦', '怡尔', '萦莹', '熠文', '瑶舜', '瑶纤',  '秋琳', '江燕',
  '妍灵', '莹莹', '梦怡', '怡澜', '昕妍', '幸怡', '凯琳', '绮文',  '智美', '婧涵', '怡新',
  '同芬', '敏洁', '洪英', '娜安', '宝艳', '慧瑶', '嘉瑶',  '书玲', '婧洁', '瑶漫', '瑶祈',
  '瑶麒', '瑶润', '怡祺', '怡壬', '怡水', '怡微',  '素红', '忆琳', '春燕', '伟琴', '晶茹',
  '美莹', '智颖', '媛麟', '婧嘉', '鸿雪',  '欣妍', '淑燕', '厚美', '一娜', '艺文',
  '婷悦', '园媛', '舜文', '志萍', '俊琳',  '炎玲', '颜燕', '彦怡', '燕纯', '燕澜', '燕煊',
  '燕扬', '阳妹', '阳冉', '阳嫣',  '业媛', '夜蓉', '漪霞', '怡碧', '怡恩', '怡绯', '怡风',
]

const firstName = [
  '赵', '钱', '孙', '李', '周', '吴', '郑', '王',
  '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨',
]


const telArr = [135,136,137,138,139,147,150,151,152,157,158,159,172,178,182,183,184,187,188,198]

const mailArr = [
  'zhangsan@gov.cn', 'lisi@gov.cn', 'wanger@gov.cn', 'zhanghu@gov.cn', 'jiangyi@gov.cn'
]

const dataArr = ['临安区雨量监测设备信息', '临安区风险区表', '临安区仓库信息', '临安区应急撤离信息', '临安区专家信息', '临安区地灾巡查信息']

const nameLength = secondName.length
const firstNameLength = firstName.length
const telArrLength = telArr.length

function getRandomNum(lbound, ubound) {
  return (Math.floor(Math.random() * (ubound - lbound)) + lbound);
}

export function getTel() {
  return telArr[getRandomNum(1,getRandomNum(1,telArrLength))] + getSubTel()
}

export function getName() {
  return firstName[getRandomNum(1,firstNameLength)] + secondName[getRandomNum(1,nameLength)]
}

export function getEmail() {
  return mailArr[getRandomNum(1,mailArr.length)]
}


export function getSubTel() {
  var str="1234567890"
  var s = str.split("")
  var t="";
  for (var i=0;i<7;i++){
    t+=s[getRandomNum(1,10)];
  }
  return t
}

export function getID() {
  var str="1234567890"
  var s = str.split("")
  var t="";
  for (var i=0;i<10;i++){
    t+=s[getRandomNum(1,10)];
  }
  return t
}

export function getRight() {
  const first = getRandomNum(1,3)
  const second = first === 2 ? 3 : getRandomNum(1,4)
  return [first, second]
}

export function getDataName() {
  return dataArr[getRandomNum(1,dataArr.length)]
}




export function getAllData() {
  return {
    leader: getName(),
    name: getName(),
    email: getEmail(),
    tel: getTel()
  }
}

export function getPriData() {
  const arr = []
  const arrLength = getRandomNum(3, 10)
  for (let i =0; i< arrLength; i++) {
    arr.push({
      dataName: getDataName(),
      dataId: getID(),
      right: getRight(),
    })
  }
  return arr
}







